---
kind: type
id: T:Autodesk.Revit.DB.Macros.AddInIdAttribute
source: html/f5642e13-82ba-36fa-c4e1-ac03aa3498f3.htm
---
# Autodesk.Revit.DB.Macros.AddInIdAttribute

The custom AddInId attribute for Macros macros use only.

## Syntax (C#)
```csharp
public class AddInIdAttribute : Attribute
```